# ActualPowerLoad Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ActualPowerLoad Property
Space Class See Also
---
Get the Actual Power Load of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ActualPowerLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualPowerLoad As Double
	Get
```

Visual C++
---
```text
public:
property double ActualPowerLoad {
	double get ();
}
```

# Remarks
This property is used to get the Actual Power Load of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace